[{"movieId":1,"title":"SPECTRE","synopsis":"In SPECTRE, a cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.","director":"Sam Mendes","casts":["Daniel Craig","Ralph Fiennes","Ben Whishaw","Naomie Harris","Rory Kinnear","Christoph Waltz","Léa Seydoux","Monica Bellucci","David Bautista","Andrew Scott"],"genre":"Action","ageRating":"PG13","showingStatus":"NOW_SHOWING","reviews":[]},{"movieId":2,"title":"Legend","synopsis":"From Academy Award® winner Brian Helgeland (L.A. Confidential, Mystic River) and Working Title (The Theory of Everything) comes the true story of the rise and fall of London’s most notorious gangsters, Reggie and Ronnie Kray, both portrayed by Tom Hardy in a powerhouse double performance. Together, the Kray Twins take over the city. But as their reign expands, powerstruggles, fierce madness, and a woman diminishes their bond; the weak link that could cause their empire to collapse. Legend is a classic crime thriller taking us into the secret history of the 1960s and the extraordinary events that secured the infamy of the Kray twins.","director":"Brian Helgeland","casts":["Tom Hardy","Emily Browning","Taron Egerton","Colin Morgan","David Thewlis"],"genre":"Crime","ageRating":"M18","showingStatus":"COMING_SOON","reviews":[]},{"movieId":3,"title":"The Martian","synopsis":"During a manned mission to Mars, Astronaut Mark Watney (Matt Damon) is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive. Millions of miles away, NASA and a team of international scientists work tirelessly to bring “the Martian” home, while his crewmates concurrently plot a daring, if not impossible rescue mission. As these stories of incredible bravery unfold, the world comes together to root for Watney’s safe return. Based on a best-selling novel, and helmed by master director Ridley Scott, THE MARTIAN features a star studded cast that includes Jessica Chastain, Kristen Wiig, Kate Mara, Michael Peña, Jeff Daniels, Chiwetel Ejiofor, and Donald Glover.","director":"Ridley Scott","casts":["Matt Damon","Jessica Chastain","Kristen Wiig","Jeff Daniels","Chiwetel Ejiofor","Michael Pena","Kate Mara","Sean Bean","Sebastian Stan","Mackenzie Davis"],"genre":"Adventure","ageRating":"PG13","showingStatus":"END_OF_SHOWING","reviews":[{"movieGoer":"Sridhar_Rajamani","rating":3,"text":"Innovative plot."},{"movieGoer":"fat_hamster","rating":5,"text":"Plot was great. Taught us not to give up and fight for survival using the knowledge of science and botany. There were some intense moments. Enjoyed this movie."},{"movieGoer":"yyhoe","rating":5,"text":"Love it. Show us what we can do if determined"},{"movieGoer":"theneelie","rating":4,"text":"Great movie, learnt some scientific knowledge from the show. More surprises."},{"movieGoer":"ahpapa","rating":4,"text":"Worth the time. Highly recommended."},{"movieGoer":"onlysue","rating":4,"text":"Its indeed a great movie worth watching! The entire storyline was exciting \u0026 intense too. Highly recommended!"}]},{"movieId":4,"title":"Burnt","synopsis":"Chef Adam Jones (Bradley Cooper) had it all—and lost it. A two-star Michelin rockstar with the bad habits to match, the former enfant terrible of the Paris restaurant scene did everything different every time out, and only ever cared about the thrill of creating explosions of taste. To land his own kitchen and that third elusive Michelin star though, he’ll need the best of the best on his side, including the beautiful Helene (Sienna Miller). Burnt is a remarkably funny and emotional story about the love of food, the love between two people, and the power of second chances.","director":"John Wells","casts":["Bradley Cooper","Sienna Miller","Omar Sy","Daniel Brühl","Matthew Rhys","Uma Thurman","Emma Thompson","Alicia Vikander","Lily James"],"genre":"Drama","ageRating":"NC16","showingStatus":"NOW_SHOWING","reviews":[{"movieGoer":"Vampire","rating":4,"text":"I enjoyed it. Storyline is nice. Somehow predictable, but there are still unexpected twists in the show, which is great. I like Adam Jones’s passion of food. And this movie shows me part of the restaurant which I never knew (The preparations needed)."},{"movieGoer":"ULTRON","rating":5,"text":"Wonderful acting by wonderful cast and a wonderful story. it will rise above your expectations. very worth watching"},{"movieGoer":"aflufybuny","rating":4,"text":"Good acting generally, close depiction of subject matter with clear simplified goals of the characters whilst focused on emotive acting illustrating individual dilemas. One should emulate good values, discard bad habits and traits of the industry."},{"movieGoer":"Psngx","rating":5,"text":"The show has exceeded my expectations and would certainly exceed yours too. Though the storyline\u0027s pretty predictable, it was a heartwarming one."}]},{"movieId":5,"title":"Our Times 我的少女時代","synopsis":"We all had to live through and rise above the awkward years in high school, and regardless how long it may have been a distant past you wish to forget, there\u0027s always a beautiful memory somewhere waiting to be awakened. A joyful moment that truly belongs to you. An ordinary high school girl Lin Truly (played by Vivian Sung) pines over the most popular guy in school Ouyang Extraordinary (played by Dino Lee). The school\u0027s troublemaker Hsu Taiyu (played by Ta Lu Wang) falls for the prettiest girl in school Tao Minmin (played by Dewi Chien). Together, Truly and Taiyu, work through misadventures to help each other win their dream dates. Through this youthful rite of passage, their friendship evolves and they learn a thing or two about true love.","director":"Frankie Chen","casts":["Vivian Sung"," Darren Wang"," Dino Lee"," Dewi Chien"],"genre":"Romance/ Drama","ageRating":"PG13","showingStatus":"NOW_SHOWING","reviews":[]}]