[{"title":"Spectre","status":"Now Showing","synopsis":"In SPECTRE, a cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.","director":"Sam Mendes","cast":["Daniel Craig","Ralph Fiennes","Ben Whishaw","Naomie Harris","Rory Kinnear","Christoph Waltz","Léa Seydoux","Monica Bellucci","David Bautista","Andrew Scott"],"genre":"Action Adventure","rating":"PG13","reviews":[]},{"title":"The Martian","status":"Now Showing","synopsis":"During a manned mission to Mars, Astronaut Mark Watney (Matt Damon) is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive. Millions of miles away, NASA and a team of international scientists work tirelessly to bring “the Martian” home, while his crewmates concurrently plot a daring, if not impossible rescue mission. As these stories of incredible bravery unfold, the world comes together to root for Watney’s safe return. Based on a best-selling novel, and helmed by master director Ridley Scott, THE MARTIAN features a star studded cast that includes Jessica Chastain, Kristen Wiig, Kate Mara, Michael Peña, Jeff Daniels, Chiwetel Ejiofor, and Donald Glover.","director":"Ridley Scott","cast":["Matt Damon","Jessica Chastain","Kristen Wiig","Jeff Daniels","Chiwetel Ejiofor","Michael Pena","Kate Mara","Sean Bean","Sebastian Stan","Mackenzie Davis"],"genre":"Action Adventure","rating":"PG13","reviews":[]},{"title":"May Who?","status":"Now Showing","synopsis":"Pong (Bank – Thiti) is a high school geek who belongs to a group of high school outcasts known as the ‘Invisibles’. He enjoys letting his imagination run wild, drawing cartoons of a girl he likes. He doesn’t have the guts to ask her out because she belongs to a more popular clique in school. Pong’s cartoon illustration is the reason he gets to know a schoolmate named May. A nickname, so common for Thai girls that whenever anyone talks about a girl named May, whoever is listening will ask, “May who?”","director":"Chayanop Boonprakob","cast":["Sutatta Udomsilp","Thiti Mahyotaruk","Thanapob Leeratanakachorn"],"genre":"Romantic Comedy","rating":"PG","reviews":[]}]